# vsoSetGlazingArea

## Description
```pascal
PROCEDURE vsoSetGlazingArea(GlazingArea : REAL);
```

```python

def vs.vsoSetGlazingArea(GlazingArea):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|GlazingArea|REAL||

## Version
Availability: from Vectorworks 2020
## Category
* Object Events